[
  {
    "Classification": "Combat",
    "ClassName": "Barbarian",
    "HitDie": 12,
    "ManaDie": 4,
    "ProficiencyCount": 3,
    "MagicBooks": 1,
    "Cantrips": 15,
    "Chances": 9,
    "Description": "Eternal rage is a good rage. Barbarians have a couple of routes they can choose to follow. Way of the totem allows you to choose an animal that you can share strength with. You turn into a half were-creature with that animal, calling upon it during your rage, imbuing your body with the totem's power. Next is the way of the berserker. The lower your health, the harder you hit. It's risky but could be worth the risk of your life. \n        All barbarians are gifted with Rage, a unique ability that allows them to burn their chances to make their hits deal double damage. When enraged, attacking and moving count as one action not two, allowing a barbarian to move across the battlefield and cleave his way through enemies as Rage also gives him a movement speed bonus. The more enemies or damage he deals prolongs his rage eventually reaching a Fervor. Each way provides a different kind of Fervor. The totem barbarians temporarily transform into a full blown were-beast, Berzerker’s attacks can be made faster, and if they are sitting on the verge of death as they love to do; they become one of the highest damage output classes in the entire game.The way of ink allows them to channel all their inked tattoo’s and unleash a devastating flurry of elemental strikes",
    "Starter": "Yes",
    "SpellCastingModifier": "Int",
    "StatFavor1": "Str",
    "StatFavor2": "Con",
    "WIP": "No"
  },
  {
    "Classification": "Combat",
    "ClassName": "Brawler",
    "HitDie": 12,
    "ManaDie": 8,
    "ProficiencyCount": 3,
    "MagicBooks": 1,
    "Cantrips": 15,
    "Chances": 6,
    "Description": "Who needs armor when you have gauntlets? Brawlers need no armor as their fists are enough. Strong as any blade and often more reliable than any forged steel. The brawler specializes in hand to hand combat, throwing punches while up close and personal. They can attack more often than other classes, landing 2 hits per AP while other classes can only land 1.\n\tThe brawler is the close combat champion of one on one duels, using heavy gauntlets to stun or throw their foes around often leaving them incapable of being able to fight back. The terrain is your weapon, the ground, walls, tree’s, boulders, those are the anvil you are the incarnation of the hammer;break them down and make sure your foes won’t be getting up.",
    "Starter": "Yes",
    "SpellCastingModifier": "Int",
    "StatFavor1": "Str",
    "StatFavor2": "Dex",
    "WIP": "No"
  },
  {
    "Classification": "Combat",
    "ClassName": "Crusader",
    "HitDie": 10,
    "ManaDie": 10,
    "ProficiencyCount": 4,
    "MagicBooks": 3,
    "Cantrips": 15,
    "Chances": 5,
    "Description": "Evil, undead, sickly creatures, all must be rid. Crusaders spend their time making sure that the world is cured from the sickness known as corruption. Wielding a white book or two known as Celestia, they are able to deal great amounts of damage to dark tainted creatures, such as undead. At half health, they regain all of their mana in a burst of energy.They have a unique relationship with Clerics and Healers, all three can utilize chapels based in certain virtues which can each teach them a special spell.\nCrusaders are the only combat class who can use Chapel spells and can really bring some of them to the forefront of combat and decimate their foes. Crusaders are also multi-purpose and often bring healing magic to the front lines as sort of a self healing front line member who mostly doesn’t need backup unless they are getting slammed by something that’s too big for one person to fight alone. While they lack any special martial abilities the magical channeling they have more than compensated for their simple nature.",
    "Starter": "Yes",
    "SpellCastingModifier": "Int",
    "StatFavor1": "Int",
    "StatFavor2": "Con",
    "WIP": "No"
  },
  {
    "Classification": "Combat",
    "ClassName": "Guardian",
    "HitDie": 12,
    "ManaDie": 8,
    "ProficiencyCount": 4,
    "MagicBooks": 2,
    "Cantrips": 15,
    "Chances": 6,
    "Description": "Stand as a fortress, lead and protect those around you. Three codes allow for a variety of playstyles. Code of the Warlord required leadership and command, providing your group with tactics and strategy. Code of the Juggernaut requires great bravery as you meet the enemy face to face, using both offence and defence, trying to keep the heat off of your team. Lastly, Code of the Fortress, you do as the name might imply, you taunt the enemy and stand as an unbreakable fortress, protecting those close to you at all costs. \nThe three Codes offer the Guardian a staying power that allows them to be the foundation of a battleline and makes him one of the most important members of the party, using his armor and shield he can ensure nothing gets past him. Defending and being cautious will serve a guardian well, waiting for your foes to come close and then use your shield action to block attacks while countering with your own attacks will cause enemies to focus on you and leave your friends alone.",
    "Starter": "Yes",
    "SpellCastingModifier": "Int",
    "StatFavor1": "Con",
    "StatFavor2": "Dex",
    "WIP": "No"
  },
  {
    "Classification": "Combat",
    "ClassName": "Knight",
    "HitDie": 10,
    "ManaDie": 8,
    "ProficiencyCount": 4,
    "MagicBooks": 2,
    "Cantrips": 15,
    "Chances": 7,
    "Description": "Stand for your order or go down in its name. Each knight has an order, a mindset and group they follow and devote themselves towards. You know stances to enhance your fighting and a unique boon from your order. Each order has its own boons and flavor. Maybe you'll be a Crow Knight who serves death and tends the graves. Maybe Iron, who believe their strength to be the pinnacle. Or maybe Rosehelm who devote themselves to chivalry and charisma. If you want a different order, simply ask and we have more.\nKnights have more variety than nearly any other combat class by far, Each order is suited for many situations. All of them are devastating and capable of causing mayhem on the battlefield or in some cases being masters of negotiation or even being the problem solver. Every knight order conveys styles and beliefs and the Tenet’s they abide by are the stylistic forms of fighting that each have a strength with a trade off.\n        The stances are as follows;\nOffensive Stance-Grants adv on every attack but penalizes Ac by your Str modifier\nDefensive Stance-Defense add’s +2 to AC but drops movement by half per turn.\nParrying Stance-Lets every attack made on you be counter via a roll off. Beating them gives you free attacks.\nCasting Stance-adds an extra casting modifier to your spell rolls but penalizes your melee strikes, by the same amount.\nFinishing Stance-Extends your crit range of all weapons by 1, and increases crit multiplier by 2, reduces AC  by Str modifier, and cuts speed in half. \n6th Tenet- Provided by the order if it’s not it’s replaced with Ranged Stance-Which provides adv to all ranged attacks but prevents you from moving after shooting, forcing you to take up one position and staying there.",
    "Starter": "Yes",
    "SpellCastingModifier": "Int",
    "StatFavor1": "Str",
    "StatFavor2": "Wis",
    "WIP": "No"
  },
  {
    "Classification": "Combat",
    "ClassName": "Marksman",
    "HitDie": 8,
    "ManaDie": 8,
    "ProficiencyCount": 6,
    "MagicBooks": 2,
    "Cantrips": 15,
    "Chances": 4,
    "Description": "Bow and arrow, crossbow or gun in hand, ammo at the ready! With three paths to choose, you are sure to find your fit. Scouts can shoot while moving, allowing you to get out of cover, shoot and return in one turn. Snipers like to deal damage and take out specific weaknesses in the enemies they fight. Projectile marksmen love to create odd ammunition to shoot from their weapons, from elemental arrows to a clutch of marbles. \nThe ever capable marksman no matter what kind you pick they all are ranged combatants dealing damage from afar and using that distance to turn them into consistent damage dealers, all Marksman can aim their shots, which provide a bonus to accuracy or they can target specific parts on an enemy at a penalty for special kinds of damage, or crippling the enemies. The scout’s ability to move and fire while covering the gaps in the front line make them ideal candidates to cripple and disable foes, whereas Snipers love aiming for the weakest shots and ensuring every shot lands true. Projectile marksmen use them both to cause chaos and disorder among their enemies.",
    "Starter": "Yes",
    "SpellCastingModifier": "Int",
    "StatFavor1": "Dex",
    "StatFavor2": "Wis",
    "WIP": "No"
  },
  {
    "Classification": "Combat",
    "ClassName": "Ranger",
    "HitDie": 10,
    "ManaDie": 8,
    "ProficiencyCount": 5,
    "MagicBooks": 2,
    "Cantrips": 15,
    "Chances": 6,
    "Description": "Rangers roam, but don't take the roaming to mean they are helpless. With three different creeds that they can devote themselves to, they have several ways to be played. Creed of rain loves to make it rain with arrows, causing AOE attacks with the barrage of arrows. Creed of the hunt allows you something special, not only an animal companion but also having special abilities with your animal. Creed of the Blade allows you twin blades and an uncanny ability to be quite nimble with the blades. \nRangers are a classic combination of ranged combat and up front fighting, they can move and shoot, jumping between fighting and ranged combat. The Ranger no matter their Creed have access to rapid firing their bow to allow for them to fire multiple shots a turn for a reduced AP cost to shoot. Using their Creed as a backup, Rangers are a ranged force to be reckoned with on the front line of any engagement.",
    "Starter": "Yes",
    "SpellCastingModifier": "Int",
    "StatFavor1": "Dex",
    "StatFavor2": "Con",
    "WIP": "No"
  },
  {
    "Classification": "Combat",
    "ClassName": "Rogue",
    "HitDie": 8,
    "ManaDie": 6,
    "ProficiencyCount": 4,
    "MagicBooks": 2,
    "Cantrips": 15,
    "Chances": 5,
    "Description": "Dagger, dagger, dagger... not enough dagger. Rogues, unlike in normal dnd, have the unique ability to throw more knives than most enemies know what to do about. They can throw three daggers or four throwing knives in each hand every attack. They do get some sneaky abilities and are proficient in rooftop running. Always remember, a rogue can never have enough throwing weapons.\nRogues rely on buying lots of expendable cheap weapons and using them to deal as much damage as possible, being able to throw six daggers in a turn makes their damage potential massive. Though they can use any throwing weapon, axes, daggers, knives, shuriken, javelins, chakram, darts, spikes and needles all can be used to eviscerate enemies.  The size of the throwing weapons determine how many you can throw in a turn, with Javelins being the heftiest and largest you can only throw 4 a turn, but you can throw 1d12 Needles or darts in a turn. The big difference is the damage of each projectile. The rule is the smaller the thrown weapon the smaller the damage dice and vice versa. Though smaller weapons can be used with weapon oils or poisons to inflict nasty debuffs on your foes while reserving the bigger weapons for pure damage potential.",
    "Starter": "Yes",
    "SpellCastingModifier": "Int",
    "StatFavor1": "Dex",
    "StatFavor2": "Str",
    "WIP": "No"
  },
  {
    "Classification": "Combat",
    "ClassName": "Warden",
    "HitDie": 12,
    "ManaDie": 6,
    "ProficiencyCount": 4,
    "MagicBooks": 3,
    "Cantrips": 15,
    "Chances": 8,
    "Description": "The Jailor, Justice and Jury. Wardens act as the jailors of the world, finding criminals and putting them where they belong, Jail. Some decide to take things into their own hands and they don't let the criminals get to their jail safe haven. Each warden has a different and unique style of fighting. Some use double hand axes, other use polearms almost more adeptly than acrobats. They are able to use all of the damage types with each weapon they specialize in, what that weapon is, is up to you. Wardens are an interesting bunch as there’s no right way to play them. These skilled fighters have trained with a number of different weapons but mostly so with their chosen weapon. This means that whatever abilities the weapons can have, you know how to utilize them. Being a combat class, you also really want to be up in the front line of battle. However, remember that magic can be an aide to you in more ways than one. They can use magical implements like weapons and are more than capable of being a tanky all rounder for all combat scenarios.\nThe Warden is one of the foremost examples of a fully customizable class, the weapons, the style, your armor. Wardens can use any weapon they can find, even sometimes preferring to use non-weapons as weapons. Nothing sends a message like using a miner’s pickaxe or a glass bottle to kill your enemies. Wardens are the simplest class in most people's eyes. They have weapons and their good with them, nothing special besides how they use said weapons. In the hands of a warden every martial weapon has their special abilities brought to the forefront, making them deadlier and more dangerous.",
    "Starter": "Yes",
    "SpellCastingModifier": "Int",
    "StatFavor1": "Con",
    "StatFavor2": "Str",
    "WIP": "No"
  },
  {
    "Classification": "Combat",
    "ClassName": "Myrmidon",
    "HitDie": 12,
    "ManaDie": 8,
    "ProficiencyCount": 2,
    "MagicBooks": 2,
    "Cantrips": 15,
    "Chances": 8,
    "Description": "If fireball were a mele attack",
    "Starter": "No",
    "SpellCastingModifier": "Int",
    "StatFavor1": "Con",
    "StatFavor2": "Str",
    "WIP": "Yes"
  },
  {
    "Classification": "Magic",
    "ClassName": "Bard",
    "HitDie": 8,
    "ManaDie": 8,
    "ProficiencyCount": 5,
    "MagicBooks": 3,
    "Cantrips": 30,
    "Chances": 2,
    "Description": "Sing, dance and play your way into a way of adventuring like no other. Bards use their musical talents to uplift, bolster and cast spells in ways that no one else can. Bards can specialize in a few different instruments but usually stick to one or two. Bards are one of the less seen magic classes, often being a general use caster especially with their magical songs and talents. The unique bardic spells are one of the most powerful tools they have, each one can help and cover areas that no one else in the party can do. A few find ways to turn their voice into an instrument so that they are never without a casting implement. \nThe biggest thing to keep in mind when playing a bard is to combine your bardic spells with other support type spells. Healing magic and bardic spells pair brilliantly and can make you an incredible healer for supporting your comrades. Though you can use some offensive spells as combo fuel too. The magic potential of the bard is in its utility between swapping from supporting teammates or inflicting nasty damage on targeted foes. Being the only charisma caster makes them the face of the party and a team player through and through.",
    "Starter": "Yes",
    "SpellCastingModifier": "Cha",
    "StatFavor1": "Cha",
    "StatFavor2": "Dex",
    "WIP": "No"
  },
  {
    "Classification": "Magic",
    "ClassName": "Battlemage",
    "HitDie": 12,
    "ManaDie": 10,
    "ProficiencyCount": 4,
    "MagicBooks": 5,
    "Cantrips": 30,
    "Chances": 3,
    "Description": "Spells or sword? Both, both is good. The battle mage is what happens when a warrior teaches a mage. Battle Mages can often tank hit and deal that damage right on back. They are one of the odd mage classes that fit half way between combat and magic classes. There's two kinds of Battlemage, one that focuses on Health and one that focuses on Mana.",
    "Starter": "Yes",
    "SpellCastingModifier": "Int/Wis",
    "StatFavor1": "Str/Int",
    "StatFavor2": "Con/Wis",
    "WIP": "No"
  },
  {
    "Classification": "Magic",
    "ClassName": "Cleric",
    "HitDie": 8,
    "ManaDie": 10,
    "ProficiencyCount": 4,
    "MagicBooks": 5,
    "Cantrips": 30,
    "Chances": 3,
    "Description": "Don't take my kindness for weakness. Clerics both heal and deal damage. They aren't the most hearty of the casters but that doesn't stop them from often throwing themselves in danger just to save their party members. Most will focus heavily on two main magic branches, Life and Celestia, the two main white magic branches.Clerics also often wield heavy blunt weapons paired with their spells to put the hurt on any undead and abominations they cross paths with. The clerics, healers and crusaders have a network of Chapels to the Omuns, each dedicated to a specific Virtue. Each chapel teaches a specific Virtuous spell, that Clerics and healers and Crusaders can all learn. \nClerics are vital members of a party everyone else can use to rally around or alongside. The cleric is often the one the rest of the party forms around during battle for quick heals. Though there are circumstances when the battle line spreads out drastically forcing the Cleric play running between their party members and healing and fighting every chance they get. The cleric has their unique chapel spells which are often fairly strong and can help depending on the given scenario.",
    "Starter": "Yes",
    "SpellCastingModifier": "Wis",
    "StatFavor1": "Wis",
    "StatFavor2": "Str",
    "WIP": "No"
  },
  {
    "Classification": "Magic",
    "ClassName": "Healer",
    "HitDie": 6,
    "ManaDie": 12,
    "ProficiencyCount": 4,
    "MagicBooks": 4,
    "Cantrips": 30,
    "Chances": 2,
    "Description": "Healers are in the back, but far from unimportant. Less frequently known as white mages, Healers are specialized in books of Life, usually starting with the first two books. They spend their time tending and caring for those who can’t, oftentimes finding themselves beside clerics in abbeys, they find strength in praying to omuns for strength and guidance to heal their party members more. However, never take them for being helpless as they can employ a class specific spell called \"Evoke\". They also benefit from their close ties to Clerics and Crusader’s visiting chapels not only allows Healers to gain the unique spell from each chapel. One additional benefit that each chapel has is they have a small gift for each Healer who stops in and does some work with them, providing the chapel with your services Healers can be given a box containing a Free magic book as well as a trinket for helping that chapel.\n        The healer often hides behind beefier classes and provides a constant stream of healing or ranged spell support to aid their comrades. They have a unique spell called Invoke which allows them to go from being the most timid class in the battle line to becoming a fast moving flanker that allows them to completely turn the tide of battle against undead, abominations or anything weak to their holy Flame. Invoke grants a flight speed of 40 ft a turn, that can be used without penalizing attack so the cleric can use the other half of invoke, which is a flaming sword of mana to launch blades of radiant flame upon their foes.",
    "Starter": "Yes",
    "SpellCastingModifier": "Wis",
    "StatFavor1": "Wis",
    "StatFavor2": "Con",
    "WIP": "No"
  },
  {
    "Classification": "Magic",
    "ClassName": "Mage",
    "HitDie": 6,
    "ManaDie": 12,
    "ProficiencyCount": 3,
    "MagicBooks": 6,
    "Cantrips": 30,
    "Chances": 2,
    "Description": "A mage is only as good as their arsenal of spells. Adept at spellcasting, mages have spent their time learning from masters before them. Some chose to attend magic academies, while others may learn from a master or two. Either way, they earn books of worth, tomes that not only signify what they have accomplished, but also enable unique boons for the mage. Along with the books of worth, mages usually pick a pallet, a color of spellcasting that boosts certain abilities. Mages are the general purpose caster, able to specialize in the wide variety of spells and tools they get. \nThe mage strives to keep range between themselves and their foes, using projectile spells to damage foes from afar. Though that's not to say the mage doesn’t have nasty spells for when some fool gets to close. Touch spells, ray spells, and others can all bring the pain to bear on anything that thinks rushing you is a good idea. You are a caster and the mage has more variety than any other casting class you can speck them into being just about anything. Using your books of worth, your feat and you large amount of starting spell books you can make an absolute monster of a damage dealer, though all this versatility does have one scary tradeoff. Your HP is the lowest among everyone, so watch your back.",
    "Starter": "Yes",
    "SpellCastingModifier": "Int",
    "StatFavor1": "Int",
    "StatFavor2": "Wis",
    "WIP": "No"
  },
  {
    "Classification": "Magic",
    "ClassName": "Medium",
    "HitDie": 8,
    "ManaDie": 10,
    "ProficiencyCount": 4,
    "MagicBooks": 5,
    "Cantrips": 30,
    "Chances": 4,
    "Description": "The dead can be used for good as well as evil, but this is for the betterment of the world. The medium is a spellcaster who's turned a dark page, and uses the Books of the Dead to help solve crimes, trying to do good by the world. These black mages are some of very few entrusted with such dangerous magics. Necromancy has proved to be a useful tool for these mages of the dark arts. They often make bone amalgams of non-humanoids that serve as their tools of choice. Though with all their powers they are often heavily scrutinized by others for their praction of necromancy which in most era's is considered illegal, though for you and other's of the Black mage court you have been given specific licences to preform your duties. Use your powers wisely or an untimely end will be almost certain.",
    "Starter": "Yes",
    "SpellCastingModifier": "Wis",
    "StatFavor1": "Wis",
    "StatFavor2": "Cha",
    "WIP": "No"
  },
  {
    "Classification": "Magic",
    "ClassName": "Spellsword/Enchanter",
    "HitDie": 12,
    "ManaDie": 8,
    "ProficiencyCount": 3,
    "MagicBooks": 4,
    "Cantrips": 30,
    "Chances": 3,
    "Description": "A sword is as good as it's wielder, but it doesn't hurt to put a spell on it. Spellswords focus on buffing their weapons with different elemental charges and sometimes buffing the weapons of others they travel with. Spellswords are especially handy when fighting a vast variety of enemies that have different elemental affinities. You can spot them in more magically advanced societies quite commonly. \nIf you want to have a good rule of thumb to follow, then use the following: If your weapon isn’t enchanted or buffed in some way, do that and then attack. Wash, rinse and repeat. The tide of battle ebbs and wanes and you dance the front line striking with enchanted blades and weapons to turn the fight in the party's favor. With elemental enemies your role in the party can be an excellent counter to elementally based enemies that are unable to be taken down with anything but their counters. Pack a wide variety of spells and prepare yourself to defend the party when one pops up.",
    "Starter": "Yes",
    "SpellCastingModifier": "Wis/int",
    "StatFavor1": "Wis/Int",
    "StatFavor2": "Con",
    "WIP": "No"
  },
  {
    "Classification": "Magic",
    "ClassName": "Summoner/Conjurer",
    "HitDie": 8,
    "ManaDie": 12,
    "ProficiencyCount": 3,
    "MagicBooks": 5,
    "Cantrips": 30,
    "Chances": 2,
    "Description": "Having friends is useful, but summons and conjures are always there to back you up. Summoners can work in a few ways. Either they have formed a unique bond with each summon they possess or they managed to get their hands on a very rare Summons spell book. There is a branch of summoners who instead of books rely on a combination of books, making pacts and using totems containing the spirit of powerful beasts and beings.\n        Summons come in all manner of shapes and sizes each path of summoning can yield different results. The totem summoners rely on finding and looting ruins or finding the lairs of beasts and making deals with them. Tamer Summoner’s find beasts or buy them from captivity and develop a deep comradeship with their beasts. The book summoners often rely solely on the summoning books and the powerful summons contained within them. Though all these paths are viable and can be incredibly powerful in their own ways, the summons themselves have weaknesses and if harmed the totem and book summoners need only de-summon them, whereas Tamer summons need to readily heal their  summons. But Tamer summons often have far stronger summons than the average summoner. Each has their pros and cons. \nOn the flip side of Summoners, Conjurers summon constructions that they build from their own mana. Conjurers can imbue their constructs with another spell to give the construct special effects. Conjuring also can come in the flavor in the physical conjuring of elementals from other planes of existence.They also create constructs and elementals from their own mana and imbue them with intelligence in some cases. \n        They are a rare bunch, usually only eight Conjurer’s are around at a time due to how dangerous their magic is. They are a secretive bunch but their unique conjurer spells can literally instantly change the battlefield with how strong some of them are. Mixing magic with their conjures is how they can dish out some truly devastating damage.",
    "Starter": "Yes",
    "SpellCastingModifier": "Wis/Int",
    "StatFavor1": "Wis/Int",
    "StatFavor2": "Int/Wis",
    "WIP": "No"
  },
  {
    "Classification": "Magic",
    "ClassName": "Vigilant",
    "HitDie": 8,
    "ManaDie": 12,
    "ProficiencyCount": 3,
    "MagicBooks": 5,
    "Cantrips": 30,
    "Chances": 3,
    "Description": "A lost spell book is a sad spell book. Vigilant are adventurers who head out with one main purpose, find lost spell books and use them. They have usually made a deal with The Magician, the father of magic, to gather spell books that have been lost to time, or taken from his library mysteriously. Vigilants usually have a mentor that gives them a couple of lost spell books to begin with. With the training they receive and their deal with The Magician, they have a knack for finding more lost spell books than most adventuring parties.         \nVigilants are one of the more interesting classes as they have a particular affiliation to a specific Omun, that being the magician the father of Cordial magic. They are a spellcaster akin to a mage or healer but instead of traditional spellbooks they have a selection of rare lost spell book that have been taken from the Magicians library, and every vigilant is tasked with gathering them for him, to ensure they don’t fall into the wrong hands.",
    "Starter": "Yes",
    "SpellCastingModifier": "Int",
    "StatFavor1": "Int",
    "StatFavor2": "Dex",
    "WIP": "No"
  },
  {
    "Classification": "Utility",
    "ClassName": "Acrobat",
    "HitDie": 8,
    "ManaDie": 8,
    "ProficiencyCount": 4,
    "MagicBooks": 3,
    "Cantrips": 20,
    "Chances": 3,
    "Description": "Agile and nimble, the Acrobats are able to perform flashy moves to help them get around. If an acrobat has a polearm, they will be able to use it to jump around the combat field and even vault over the enemies, allowing for an easy flank. It might not be within the best interest of the acrobat to do that if there are a lot of enemies in the area though as they aren't the most hearty. \nAcrobats are notorious for their ability to move fast and grab everything they can get their hands on. They are the closest you can get to being a thief, having an innate ability called Theft which allows them to steal an item from an opponent with a random chance to get something. The only guaranteed time they can steal something with a strike is when they hit with a critical attack.They are adept at moving around and ensuring the party always have some spare coin.",
    "Starter": "Yes",
    "SpellCastingModifier": "Int",
    "StatFavor1": "Dex",
    "StatFavor2": "Con",
    "WIP": "No"
  },
  {
    "Classification": "Utility",
    "ClassName": "Agent/Gypsy",
    "HitDie": 8,
    "ManaDie": 8,
    "ProficiencyCount": 5,
    "MagicBooks": 3,
    "Cantrips": 20,
    "Chances": 2,
    "Description": "Stealing secrets from those on the every end of life. Much like a secret agent, Agents have an underground information network that they can almost always tap into. They are excellent at working under pressure and getting information from people. Though they don't really like combat, they are useful in gathering and relaying useful tactics. If you need to know something about someone, you go to an agent or gypsy. However, there's two sides to every coin. Where the Agents work with the higher of society, Gypsies work with the lower of society. They will use their charm to get information from beggars and lowly slicks. Much like Agents, they too have a network chain that they constantly tap into and will gain and feed information into.\nAgents also have a wonderful amount of devices curated and created by the agent network, those gadgets and inventions are unique to the agent and they are quite capable of helping to get the information they need, or just things to utilize to do all manner of stuff. From grappling hook launchers, magical crystals that can be used to turn your clothes and whole person invisible. Where the Agents work with the higher of society, Gypsies work with the lower of society. They will use their charm to get information from beggars and lowly slicks. Much like Agents, they too have a network chain that they constantly tap into and will gain and feed information into\nWhile agents have strange devices made by their massive agent network and all those contacts. Gypsies use what they can create, the lower rungs of society have some methods often forbidden by other groups. Often utilizing primal magic enchanted items to do their information gathering or sabotaging.",
    "Starter": "Yes",
    "SpellCastingModifier": "Int",
    "StatFavor1": "Cha",
    "StatFavor2": "Dex",
    "WIP": "No"
  },
  {
    "Classification": "Utility",
    "ClassName": "Alchemist",
    "HitDie": 6,
    "ManaDie": 10,
    "ProficiencyCount": 4,
    "MagicBooks": 4,
    "Cantrips": 20,
    "Chances": 3,
    "Description": "Potions, elixirs and brews galore. Alchemists spend their time concocting brews for their party. With the right plants and components, an alchemist could even make basic explosives. Most of the time, they find themselves making simple healing and mana potions. For many alchemists, their time is spent foraging to find quality ingredients to make both familiar and new potions alike. Sometimes, new blends allow for stronger brews or even new potion effects altogether. So go out there and experiment around!\n\tAlchemists not only use their skills to make potions but all kinds of consumables from explosives to salves, all manner of chemical or herbal based consumables can be created by alchemists. They are capable of creating everything the party needs as long as they have the materials.",
    "Starter": "Yes",
    "SpellCastingModifier": "Wis",
    "StatFavor1": "Wis",
    "StatFavor2": "Dex",
    "WIP": "No"
  },
  {
    "Classification": "Utility",
    "ClassName": "Artillerist",
    "HitDie": 8,
    "ManaDie": 6,
    "ProficiencyCount": 4,
    "MagicBooks": 2,
    "Cantrips": 20,
    "Chances": 5,
    "Description": "Guns aren't common but the artillerist gets some fun ones. There's two types of guns they can get. The heavy Cindercaster or the Light Cindercaster. Both have their pros and cons. A heavy Cindercaster can fire larger pellets that deal more individual damage but it does fire slower and their movement is slower while they have it out, due to the heavy weight. Light Cindercasters are smaller but fire quicker. Unlike with the heavy Cindercaster, movement is unrestricted while this one is out.\nThe Artillerist is a class that thrives in high stakes fights with massive monsters, they only occupy places where they tend to live. Often meaning seeing one is an ill omen for anyone unaccustomed to fighting such beasts. Which gives them a bit of a nasty reputation, among other adventurers and making them fairly rare outside of a couple key places.",
    "Starter": "Yes",
    "SpellCastingModifier": "Int",
    "StatFavor1": "Dex",
    "StatFavor2": "Str",
    "WIP": "No"
  },
  {
    "Classification": "Utility",
    "ClassName": "Assassin",
    "HitDie": 8,
    "ManaDie": 8,
    "ProficiencyCount": 5,
    "MagicBooks": 2,
    "Cantrips": 20,
    "Chances": 3,
    "Description": "Rooftop runs and hidden blades. These assassins are like those from Assassins Creed. A set of hidden blades are awarded to each assassin as part of their training. Hidden blades hide on the forearm under the sleeves of the wearer and can pop out towards the hands with a flick of the wrists, allowing for some interesting assassination style kills. Stealth is their friend and if you need a scout, an assassin is your best bet.\n\tThe silent and deadly assassin can disappear quickly and covertly so they can attack from places unseen. Their attacks from stealth deal massive damage, and once they show themselves they must rely on their comrades oftentimes to hide themselves from view, so they can perform another sneak attack. This takes coordination and communication, but it works like a charm, having the barbarian charge forward and blindly attack, while the assassin slips low and while the foe guards from the combat class, plunges hidden blades into a weak spot and deals hefty damage.",
    "Starter": "Yes",
    "SpellCastingModifier": "Int",
    "StatFavor1": "Dex",
    "StatFavor2": "Cha",
    "WIP": "No"
  },
  {
    "Classification": "Utility",
    "ClassName": "Monk",
    "HitDie": 10,
    "ManaDie": 6,
    "ProficiencyCount": 3,
    "MagicBooks": 4,
    "Cantrips": 20,
    "Chances": 5,
    "Description": "Roll the fists and let the blows fall. Monks are the upfront fighters, making their fists fly and using Ki to allow them to deal additional blows to their opponent. They can also use their Ki to do super human stunts such as jump a two story building in one bound or run at twice their usual speed. They will spend a good amount of time looking for scrolls of knowledge, known as palms, that give more unique abilities and attacks for the monk. \nThe palms are one of the many things that make Monks special, ki can be used to refill chances, even regenerate lost health, ki can be transferred to another ki user or even someone without ki to give them the same benefits as using it on yourself. While not as specialized as some of the other ki classes they are the humble beginnings from one first learns to use their ki.",
    "Starter": "Yes",
    "SpellCastingModifier": "Wis",
    "StatFavor1": "Dex",
    "StatFavor2": "Wis",
    "WIP": "No"
  },
  {
    "Classification": "Utility",
    "ClassName": "Outworlder",
    "HitDie": 8,
    "ManaDie": 8,
    "ProficiencyCount": 4,
    "MagicBooks": 1,
    "Cantrips": 20,
    "Chances": 3,
    "Description": "Another life, another world, but yet, so little memories. Outworlders are usually normal people from other worlds that died in their worlds and showed up in this one. They don’t usually don’t have any memories or much gear on them. They will begin with a memento from their world though, something they had on them when they died. As for the world they came from, well, the possibilities are endless. You'll begin with an extra feat.",
    "Starter": "Yes",
    "SpellCastingModifier": "Int",
    "StatFavor1": "Any",
    "StatFavor2": "Any",
    "WIP": "No"
  },
  {
    "Classification": "Utility",
    "ClassName": "Pilgrim",
    "HitDie": 10,
    "ManaDie": 8,
    "ProficiencyCount": 6,
    "MagicBooks": 3,
    "Cantrips": 20,
    "Chances": 4,
    "Description": "No class? Not a problem. Pilgrims are what happens when an adventurer just doesn't know what class they want to take on. While most other classes think them weak, they have the most potential. Spending time with other classes in training and practical combat will allow the pilgrim to copy some skills from other classes allowing them to be a versatile tool for any situation.\nThe pilgrim is the simplest class to play, seeing as they lack any of the special flavor of most of the other classes. They can gain those abilities as they begin their path to multiclass into partial versions of other classes. Lucky for you players the pilgrim is a great starting choice and is capable of surviving till the very end, cause they have nearly no downsides.",
    "Starter": "Yes",
    "SpellCastingModifier": "Int",
    "StatFavor1": "Any",
    "StatFavor2": "Any",
    "WIP": "No"
  },
  {
    "Classification": "Utility",
    "ClassName": "Scholar",
    "HitDie": 8,
    "ManaDie": 10,
    "ProficiencyCount": 4,
    "MagicBooks": 4,
    "Cantrips": 20,
    "Chances": 3,
    "Description": "I know exactly what this is, and I can tell you right now, this belongs in an archive! Adventurer Scholars are those who use knowledge to assist their comrades in all manner of ways, having the unique benefit of having both practical and intellectual knowledge of whatever knowledges they know. They may not be the best in combat or magic but they are brave and will go on perilous adventurers to ensure the preservation of history and knowledge.",
    "Starter": "Yes",
    "SpellCastingModifier": "Int",
    "StatFavor1": "Wis",
    "StatFavor2": "Cha",
    "WIP": "Yes"
  },
  {
    "Classification": "Utility",
    "ClassName": "Tracker",
    "HitDie": 10,
    "ManaDie": 8,
    "ProficiencyCount": 9,
    "MagicBooks": 2,
    "Cantrips": 20,
    "Chances": 4,
    "Description": "Skill monkey is a skill monkey. Trackers are the most skilled of any class, starting with the most skills of any. Trackers can do almost anything they can think of. Most are quite skilled tinkers, being able to come up with a design and then execute it near flawlessly compared to what they saw in their mind.The tracker is the most skill heavy class of all of them, if you need to have someone capable of doing something they are your guy.\nHaving skills lets the Tracker help their party survive, clear dungeons, and all manner of skills can help the party succeed in whatever task, quest, or side track the party has taken to detour. The group will need your skill checks to ensure they don’t end up finding themselves stuck in a dungeon trap without someone to save them.",
    "Starter": "Yes",
    "SpellCastingModifier": "Int",
    "StatFavor1": "Dex",
    "StatFavor2": "Any",
    "WIP": "No"
  },
  {
    "Classification": "Veteran",
    "ClassName": "Occultist",
    "HitDie": 10,
    "ManaDie": 10,
    "ProficiencyCount": 5,
    "MagicBooks": 4,
    "Cantrips": 20,
    "Chances": 4,
    "Description": "The Occultist is a hunter of the mythical, monsters and cults. They are one of the few regarded in a similar fashion to the Witch Hunters. They are a collection of 10 Familial clans that fight monsters, generation after generation, passing skills and knowledge down the line. Capable in all fields, these hunters are forced to master a 'jack of all trades' approach in order to route the evil in the world.",
    "Starter": "No",
    "SpellCastingModifier": "Wis",
    "StatFavor1": "Str",
    "StatFavor2": "Wis",
    "WIP": "Yes"
  },
  {
    "Classification": "Veteran",
    "ClassName": "Sentinel",
    "HitDie": 12,
    "ManaDie": 4,
    "ProficiencyCount": 4,
    "MagicBooks": 1,
    "Cantrips": 10,
    "Chances": 6,
    "Description": "Stand for what you need, but be always on the move. The Sentinel, is a far cry from a stationary defender, rather, they utilize rapid movement and the reach of their polearms to exploit enemies weaknesses and gaps in their defenses. They use throwing weapons to feign attacks and create openings for themselves to punch hard hitting strikes through the toughest opponents. Sentinels have different combat styles named after the old draconids: Dragon, Wyvern, Drake, and Wurm. Each of these pertain to how to utilize their weapons and skills, being ritual casters as well as adept masters at improvised tactics they can easily overwhelm those unfamiliar with the nuances of combat.",
    "Starter": "No",
    "SpellCastingModifier": "Int",
    "StatFavor1": "Dex/Str",
    "StatFavor2": "Str/Dex",
    "WIP": "Yes"
  },
  {
    "Classification": "Veteran",
    "ClassName": "Witch Hunter",
    "HitDie": 10,
    "ManaDie": 10,
    "ProficiencyCount": 5,
    "MagicBooks": 5,
    "Cantrips": 30,
    "Chances": 4,
    "Description": "No cult is good until it's destroyed. Witch Hunters are the only class that can use books of the black, a dark spell book that corrupts anyone who doesn't have the witch hunter's gift. They aren't corrupted by black magic and can use cursed items that would be dangerous for anyone else. If they hear about a cult, that cult had better look out, because that witch hunter will take them out.",
    "Starter": "No",
    "SpellCastingModifier": "Wis",
    "StatFavor1": "Wis",
    "StatFavor2": "Dex",
    "WIP": "Yes"
  },
  {
    "Classification": "Eastern",
    "ClassName": "Acolyte",
    "HitDie": 12,
    "ManaDie": 8,
    "ProficiencyCount": 4,
    "MagicBooks": 2,
    "Cantrips": 20,
    "Chances": 4,
    "Description": "They are a ki casting class. Think bender from Avatar the Last Airbender",
    "Starter": "Yes",
    "SpellCastingModifier": "N/A",
    "StatFavor1": "Con",
    "StatFavor2": "Wis",
    "WIP": "Yes"
  },
  {
    "Classification": "Eastern",
    "ClassName": "Kunoichi",
    "HitDie": 10,
    "ManaDie": 8,
    "ProficiencyCount": 8,
    "MagicBooks": 2,
    "Cantrips": 20,
    "Chances": 6,
    "Description": "Female only: Gypsy, Assassin, Ranger, Bard",
    "Starter": "Yes",
    "SpellCastingModifier": "N/A",
    "StatFavor1": "Cha",
    "StatFavor2": "Dex",
    "WIP": "Yes"
  },
  {
    "Classification": "Eastern",
    "ClassName": "Monk",
    "HitDie": 10,
    "ManaDie": 6,
    "ProficiencyCount": 3,
    "MagicBooks": 4,
    "Cantrips": 20,
    "Chances": 5,
    "Description": "Roll the fists and let the blows fall. Monks are the upfront fighters, making their fists fly and using Ki to allow them to deal additional blows to their opponent. They can also use their Ki to do super human stunts such as jump a two story building in one bound or run at twice their usual speed.",
    "Starter": "Yes",
    "SpellCastingModifier": "Wis",
    "StatFavor1": "Dex",
    "StatFavor2": "Wis",
    "WIP": "Yes"
  },
  {
    "Classification": "Eastern",
    "ClassName": "Ninja",
    "HitDie": 8,
    "ManaDie": 8,
    "ProficiencyCount": 8,
    "MagicBooks": 3,
    "Cantrips": 20,
    "Chances": 6,
    "Description": "Assassin, Rogue, Agent, Acrobat",
    "Starter": "Yes",
    "SpellCastingModifier": "N/A",
    "StatFavor1": "Dex",
    "StatFavor2": "Str",
    "WIP": "Yes"
  },
  {
    "Classification": "Eastern",
    "ClassName": "Onmyoji(Priest)",
    "HitDie": 8,
    "ManaDie": 12,
    "ProficiencyCount": 3,
    "MagicBooks": 6,
    "Cantrips": 40,
    "Chances": 2,
    "Description": "Ranger, cleric, healer, crusader",
    "Starter": "Yes",
    "SpellCastingModifier": "N/A",
    "StatFavor1": "Int",
    "StatFavor2": "Cha",
    "WIP": "Yes"
  },
  {
    "Classification": "Eastern",
    "ClassName": "Ronin",
    "HitDie": 12,
    "ManaDie": 6,
    "ProficiencyCount": 5,
    "MagicBooks": 1,
    "Cantrips": 10,
    "Chances": 5,
    "Description": "Masterless samuri- barbarian, spellsword, brawler, Tracker",
    "Starter": "Yes",
    "SpellCastingModifier": "N/A",
    "StatFavor1": "Str",
    "StatFavor2": "Con",
    "WIP": "Yes"
  },
  {
    "Classification": "Eastern",
    "ClassName": "Sage",
    "HitDie": 8,
    "ManaDie": 10,
    "ProficiencyCount": 4,
    "MagicBooks": 3,
    "Cantrips": 15,
    "Chances": 7,
    "Description": "Ki user who uses their ki to enhance items, much akin to enchanters",
    "Starter": "Yes",
    "SpellCastingModifier": "Wis",
    "StatFavor1": "Wis",
    "StatFavor2": "Str",
    "WIP": "Yes"
  },
  {
    "Classification": "Eastern",
    "ClassName": "Samuri",
    "HitDie": 12,
    "ManaDie": 8,
    "ProficiencyCount": 4,
    "MagicBooks": 2,
    "Cantrips": 20,
    "Chances": 7,
    "Description": "Knight, marksman, warden, battlemage",
    "Starter": "Yes",
    "SpellCastingModifier": "N/A",
    "StatFavor1": "Dex",
    "StatFavor2": "Str",
    "WIP": "Yes"
  },
  {
    "Classification": "Eastern",
    "ClassName": "Shaman",
    "HitDie": 6,
    "ManaDie": 12,
    "ProficiencyCount": 5,
    "MagicBooks": 6,
    "Cantrips": 45,
    "Chances": 3,
    "Description": "Alchemist, summoner, enchanter, Conjurer",
    "Starter": "Yes",
    "SpellCastingModifier": "N/A",
    "StatFavor1": "Wis",
    "StatFavor2": "Con",
    "WIP": "Yes"
  },
  {
    "Classification": "Eastern",
    "ClassName": "Sohei",
    "HitDie": 10,
    "ManaDie": 10,
    "ProficiencyCount": 4,
    "MagicBooks": 3,
    "Cantrips": 35,
    "Chances": 4,
    "Description": "Acrobat, pilgram, witch hunter, occultist",
    "Starter": "Yes",
    "SpellCastingModifier": "N/A",
    "StatFavor1": "Wis",
    "StatFavor2": "Str",
    "WIP": "Yes"
  },
  {
    "Classification": "Eastern",
    "ClassName": "Deviner",
    "HitDie": "",
    "ManaDie": "",
    "ProficiencyCount": "",
    "MagicBooks": "",
    "Cantrips": "",
    "Chances": "",
    "Description": "Summoner",
    "Starter": "",
    "SpellCastingModifier": "",
    "StatFavor1": "",
    "StatFavor2": "",
    "WIP": "Yes"
  },
  {
    "Classification": "Eastern",
    "ClassName": "Apothecary",
    "HitDie": "",
    "ManaDie": "",
    "ProficiencyCount": "",
    "MagicBooks": "",
    "Cantrips": "",
    "Chances": "",
    "Description": "Alchemist",
    "Starter": "",
    "SpellCastingModifier": "",
    "StatFavor1": "",
    "StatFavor2": "",
    "WIP": "Yes"
  },
  {
    "Classification": "Eastern",
    "ClassName": "Teacher",
    "HitDie": 10,
    "ManaDie": 6,
    "ProficiencyCount": 6,
    "MagicBooks": 2,
    "Cantrips": 25,
    "Chances": 8,
    "Description": "Guardian, spellsword, Agent, Pilgram",
    "Starter": "Yes",
    "SpellCastingModifier": "N/A",
    "StatFavor1": "Int",
    "StatFavor2": "Dex",
    "WIP": "Yes"
  },
  {
    "Classification": "Eastern",
    "ClassName": "Wu Jen",
    "HitDie": 8,
    "ManaDie": 10,
    "ProficiencyCount": 5,
    "MagicBooks": 8,
    "Cantrips": 25,
    "Chances": 3,
    "Description": "Male only: Historian but more wizardly- Mage, Summoner, Vigilant, bard",
    "Starter": "Yes",
    "SpellCastingModifier": "N/A",
    "StatFavor1": "Int",
    "StatFavor2": "Wis",
    "WIP": "Yes"
  },
  {
    "Classification": "Sci fi",
    "ClassName": "TECH(Technology & Hacking)",
    "HitDie": "",
    "ManaDie": "N/A",
    "ProficiencyCount": "",
    "MagicBooks": "N/A",
    "Cantrips": "N/A",
    "Chances": "",
    "Description": "",
    "Starter": "",
    "SpellCastingModifier": "",
    "StatFavor1": "Int",
    "StatFavor2": "",
    "WIP": "Yes"
  },
  {
    "Classification": "Sci fi",
    "ClassName": "CBT(Combat)",
    "HitDie": "",
    "ManaDie": "N/A",
    "ProficiencyCount": "",
    "MagicBooks": "N/A",
    "Cantrips": "N/A",
    "Chances": "",
    "Description": "",
    "Starter": "",
    "SpellCastingModifier": "",
    "StatFavor1": "Dex",
    "StatFavor2": "",
    "WIP": "Yes"
  },
  {
    "Classification": "Sci fi",
    "ClassName": "RCN(Reconnaissance)",
    "HitDie": "",
    "ManaDie": "N/A",
    "ProficiencyCount": "",
    "MagicBooks": "N/A",
    "Cantrips": "N/A",
    "Chances": "",
    "Description": "",
    "Starter": "",
    "SpellCastingModifier": "",
    "StatFavor1": "Dex",
    "StatFavor2": "",
    "WIP": "Yes"
  },
  {
    "Classification": "Sci fi",
    "ClassName": "HCHM(Heavy combat & Hazardous Materials)",
    "HitDie": "",
    "ManaDie": "N/A",
    "ProficiencyCount": "",
    "MagicBooks": "N/A",
    "Cantrips": "N/A",
    "Chances": "",
    "Description": "",
    "Starter": "",
    "SpellCastingModifier": "",
    "StatFavor1": "Str",
    "StatFavor2": "",
    "WIP": "Yes"
  },
  {
    "Classification": "Sci fi",
    "ClassName": "AMS (Assigned Medical Support)",
    "HitDie": "",
    "ManaDie": "N/A",
    "ProficiencyCount": "",
    "MagicBooks": "N/A",
    "Cantrips": "N/A",
    "Chances": "",
    "Description": "",
    "Starter": "",
    "SpellCastingModifier": "",
    "StatFavor1": "Wis",
    "StatFavor2": "",
    "WIP": "Yes"
  },
  {
    "Classification": "Sci fi",
    "ClassName": "DRV (Driver Responsible for Vehicles)",
    "HitDie": "",
    "ManaDie": "N/A",
    "ProficiencyCount": "",
    "MagicBooks": "N/A",
    "Cantrips": "N/A",
    "Chances": "",
    "Description": "",
    "Starter": "",
    "SpellCastingModifier": "",
    "StatFavor1": "Wis",
    "StatFavor2": "",
    "WIP": "Yes"
  },
  {
    "Classification": "Sci fi",
    "ClassName": "SFO (Satellite Fabricator Operator)",
    "HitDie": "",
    "ManaDie": "N/A",
    "ProficiencyCount": "",
    "MagicBooks": "N/A",
    "Cantrips": "N/A",
    "Chances": "",
    "Description": "Equipped with the Fabri-tech Wrist Mounted Computer(WMC) paired with a Tactical Display visor both are  linked with the expensive Satellite Micro Fabricator, made by Mechanica & UGIS. Description- Personnel who are trained and capable of operating the WMC and Satellite micro Fabricator. Role:Orbital Support, Long term Salvaging and, Orbital offensive capability. The Fabri-tech wrist computer paired with a Tactical display visor allows the user to be able to send requests to the orbiting Satellite Fabricator and using them they can use the entire kit together to call in orbital strikes, defenses, turrets, spare parts the list goes on. This unholy combination of abilities is only limited to the creativity and ingenuity of the Person in charge of operating it, though it does require resources, that luckily can be found when scavenging and salvaging derelicts, wrecks and all sorts of debris left over by other people in the Dark zone.",
    "Starter": "",
    "SpellCastingModifier": "",
    "StatFavor1": "Int",
    "StatFavor2": "",
    "WIP": "Yes"
  }
]